package இயேரி.தமிழிசை;

import java.util.ArrayList;
import java.util.List;

public class எழுத்துவகை  {
    final static int தமிழ்தனிகுறியீட்டுமாறிலி = 4096;
    final static int வல்லினஎண்மாறிலி = 128;
    final static int மெல்லினஎண்மாறிலி = 256;
    final static int உயிர்எண்மாறிலி = 512;
    final static int ஒற்றுஎண்மாறிலி = 1024;
    final static int ஆயுதஎண்மாறிலி =  2048;

    final static int நெடிலெண்மாறிலி = 8;
    final static int இடையினஎண்மாறிலி = வல்லினஎண்மாறிலி | மெல்லினஎண்மாறிலி;
    final static String உயிர்வகைகுறில்மாறிலி = "குறில்";
    final static String உயிர்வகைநெடில்மாறிலி = "நெடில்";
    final static String ஓற்றுமாறிலி = "ஓற்று";
    final String ஒருங்குறி;
    final int தமிழ்தனிகுறியீடு;
    final String யாபியலெழுத்துவகை;
    final static String மெல்லினமாறிலி ="மெல்லினம்";
    final static String வல்லினமாறிலி ="வல்லினம்";
    final static String இடையினமாறிலி ="இடையினம்";
    final List<String> உயிரெழுத்துநெடில்கள்  = உயிரெழுத்துநெடில்கள்();
    final List<String> உயிரெழுத்துகுறில்கள் = உயிரெழுத்துகுறில்கள்();
    final List<String> வல்லினமெய்யெழுத்துக்கள் = வல்லினமெய்யெழுத்துக்கள்();
    final List<String> மெல்லினமெய்யெழுத்துக்கள் =  மெல்லினமெய்யெழுத்துக்கள்();
    final List<String>  இடையினமெய்யெழுத்துக்கள் = இடையினமெய்யெழுத்துக்கள்();
    final List<String>  உயிரெழுத்துகுறில்குறியீடுகள் = உயிரெழுத்துகுறில்குறியீடுகள்();
    final List<String>   உயிரெழுத்துநெடில்குறியீடுகள் =  உயிரெழுத்துநெடில்குறியீடுகள்();
    public List<String>  உயிரெழுத்துகுறில்குறியீடுகள்() {


        List<String> உயிரெழுத்துகுறில்குறியீடுகள் = new ArrayList<>();
        உயிரெழுத்துகுறில்குறியீடுகள்.add("");
        உயிரெழுத்துகுறில்குறியீடுகள்.add("ி");
        உயிரெழுத்துகுறில்குறியீடுகள்.add("ு");
        உயிரெழுத்துகுறில்குறியீடுகள்.add("ெ");
        உயிரெழுத்துகுறில்குறியீடுகள்.add("ொ");
        உயிரெழுத்துகுறில்குறியீடுகள்.add("ி");
        உயிரெழுத்துகுறில்குறியீடுகள்.add("ு");

        return உயிரெழுத்துகுறில்குறியீடுகள்;
    }

    public List<String>  உயிரெழுத்துகுறில்கள்() {
        List<String> உயிரெழுத்துகுறில்கள் = new ArrayList<>();
        உயிரெழுத்துகுறில்கள்.add("அ");
        உயிரெழுத்துகுறில்கள்.add("இ");
        உயிரெழுத்துகுறில்கள்.add("உ");
        உயிரெழுத்துகுறில்கள்.add("எ");
        உயிரெழுத்துகுறில்கள்.add("ஒ");
        உயிரெழுத்துகுறில்கள்.add("இ");
        உயிரெழுத்துகுறில்கள்.add("உ");

        return உயிரெழுத்துகுறில்கள்;

    }
    public List<String> உயிரெழுத்துநெடில்கள்() {

        List<String> உயிரெழுத்துநெடில்கள் = new ArrayList<>();
        உயிரெழுத்துநெடில்கள்.add("ஆ");
        உயிரெழுத்துநெடில்கள்.add("ஈ");
        உயிரெழுத்துநெடில்கள்.add("ஊ");
        உயிரெழுத்துநெடில்கள்.add("ஏ");
        உயிரெழுத்துநெடில்கள்.add("ஓ");
        உயிரெழுத்துநெடில்கள்.add("ஐ");
        உயிரெழுத்துநெடில்கள்.add("ஔ");

        return உயிரெழுத்துநெடில்கள்;
    }

    public List<String> உயிரெழுத்துநெடில்குறியீடுகள்() {

        List<String> உயிரெழுத்துநெடில்கள் = new ArrayList<>();
        உயிரெழுத்துநெடில்கள்.add("ா");
        உயிரெழுத்துநெடில்கள்.add("ீ");
        உயிரெழுத்துநெடில்கள்.add("ூ");
        உயிரெழுத்துநெடில்கள்.add("ே");
        உயிரெழுத்துநெடில்கள்.add("ோ");
        உயிரெழுத்துநெடில்கள்.add("ை");
        உயிரெழுத்துநெடில்கள்.add("ௌ");

        return உயிரெழுத்துநெடில்கள்;
    }

    public List<String> வல்லினமெய்யெழுத்துக்கள்() {

        List<String> வல்லினமெய்யெழுத்துக்கள் = new ArrayList<>();
        வல்லினமெய்யெழுத்துக்கள்.add("க");
        வல்லினமெய்யெழுத்துக்கள்.add("ச");
        வல்லினமெய்யெழுத்துக்கள்.add("ட");
        வல்லினமெய்யெழுத்துக்கள்.add("த");
        வல்லினமெய்யெழுத்துக்கள்.add("ப");
        வல்லினமெய்யெழுத்துக்கள்.add("ற");
        return வல்லினமெய்யெழுத்துக்கள்;
    }

    public List<String> மெல்லினமெய்யெழுத்துக்கள்() {


        List<String> மெல்லினமெய்யெழுத்துக்கள் = new ArrayList<>();
        மெல்லினமெய்யெழுத்துக்கள்.add("ங");
        மெல்லினமெய்யெழுத்துக்கள்.add("ஞ");
        மெல்லினமெய்யெழுத்துக்கள்.add("ண");
        மெல்லினமெய்யெழுத்துக்கள்.add("ந");
        மெல்லினமெய்யெழுத்துக்கள்.add("ம");
        மெல்லினமெய்யெழுத்துக்கள்.add("ன");
        return மெல்லினமெய்யெழுத்துக்கள்;


    }

    public List<String> இடையினமெய்யெழுத்துக்கள்() {

        List<String> இடையினமெய்யெழுத்துக்கள் = new ArrayList<>();
        இடையினமெய்யெழுத்துக்கள்.add("ய");
        இடையினமெய்யெழுத்துக்கள்.add("ர");
        இடையினமெய்யெழுத்துக்கள்.add("ல");
        இடையினமெய்யெழுத்துக்கள்.add("வ");
        இடையினமெய்யெழுத்துக்கள்.add("ய");
        இடையினமெய்யெழுத்துக்கள்.add("ள");
        return இடையினமெய்யெழுத்துக்கள்;
    }




    எழுத்துவகை(String ஒருங்குறி, int தமிழ்தனிகுறியீடு) {
        this.ஒருங்குறி = ஒருங்குறி;
        this.தமிழ்தனிகுறியீடு = தமிழ்தனிகுறியீடு;
        this.யாபியலெழுத்துவகை = யாபியலெழுத்துவகையைபெறு();
    }

    private String யாபியலெழுத்துவகையைபெறு() {
        String யாபியலெழுத்துவகைய = "";
        if ( (this.தமிழ்தனிகுறியீடு &  ஒற்றுஎண்மாறிலி)  == ஒற்றுஎண்மாறிலி) {
            யாபியலெழுத்துவகைய = "ஓற்று";
        }
        if ( (this.தமிழ்தனிகுறியீடு &  உயிர்எண்மாறிலி)  == உயிர்எண்மாறிலி) {
            யாபியலெழுத்துவகைய = உயிர்வகையைபெறு();
        }
        return யாபியலெழுத்துவகைய;
    }

    public boolean நெடிலா() {
        return யாபியலெழுத்துவகை.equals(உயிர்வகைநெடில்மாறிலி);
    }

    public boolean குறிலா() {
        return யாபியலெழுத்துவகை.equals(உயிர்வகைகுறில்மாறிலி);
    }

    public boolean ஒற்றா() {
        return யாபியலெழுத்துவகை.equals(ஓற்றுமாறிலி);
    }
/*
    public void ஒருங்குறியைபெறுத்து(String ஒருங்குறி) {
        this.ஒருங்குறி = ஒருங்குறி;
    }

 */

    //mei	uyir	mel2	mel2	kuri/nedil	s	s	s
    //128	64	    32	    16	    8	        4	2	1
    //                          8    7    6    5    4    3            2   1   0
    //ayutham  mei      uyir     mel2 mel1 m3   m2   m1   kuril/nedil  s3  s2  s1
    //2048     1024     512      256  128  64   32   16   8            4   2   1

    public String உயிர்வகையைபெறு() {
        String உயிர்வகை ="";
        if ((this.தமிழ்தனிகுறியீடு & உயிர்எண்மாறிலி) == உயிர்எண்மாறிலி) {
            if ((this.தமிழ்தனிகுறியீடு & நெடிலெண்மாறிலி) == நெடிலெண்மாறிலி) {
                உயிர்வகை = உயிர்வகைநெடில்மாறிலி;
            }  else {
                உயிர்வகை = உயிர்வகைகுறில்மாறிலி;
            }

        }
        return உயிர்வகை;
    }

    public String மெய்வகையைபெறு() {
        if ((this.தமிழ்தனிகுறியீடு & இடையினஎண்மாறிலி) == இடையினஎண்மாறிலி) {
            return  இடையினமாறிலி;
        }

        if ((this.தமிழ்தனிகுறியீடு & வல்லினஎண்மாறிலி) == வல்லினஎண்மாறிலி) {
            return வல்லினமாறிலி;
        }
        if  ((this.தமிழ்தனிகுறியீடு & மெல்லினஎண்மாறிலி) == மெல்லினஎண்மாறிலி) {
            return மெல்லினமாறிலி;
        }
        return "";

    }

    public எழுத்துவகை குறிலைப்பெறு() {
        return குறிவிலக்கி(தமிழ்தனிகுறியீடு &  தலைகீழ்படிஇரண்டு(நெடிலெண்மாறிலி));

    }

    public எழுத்துவகை  இனஎழுத்துபெறு() {
        if (வல்லினமா(தமிழ்தனிகுறியீடு)) {
            // System.out.println( this + "=====\nதமிழ்தனிகுறியீடு=" + Binary.print(தமிழ்தனிகுறியீடு) + "& தலைகீழ்படிஇரண்டு(வல்லினஎண்மாறிலி)=" +Binary.print(தலைகீழ்படிஇரண்டு(வல்லினஎண்மாறிலி) )+ "|" + Binary.print(மெல்லினஎண்மாறிலி ) +  "== " +Binary.print( தமிழ்தனிகுறியீடு &  தலைகீழ்படிஇரண்டு(வல்லினஎண்மாறிலி) | மெல்லினஎண்மாறிலி));
            return குறிவிலக்கி(தமிழ்தனிகுறியீடு &  தலைகீழ்படிஇரண்டு(வல்லினஎண்மாறிலி) | மெல்லினஎண்மாறிலி);
        }

        if (மெல்லினமா(தமிழ்தனிகுறியீடு)) {
            return குறிவிலக்கி(தமிழ்தனிகுறியீடு &  தலைகீழ்படிஇரண்டு(மெல்லினஎண்மாறிலி) | வல்லினஎண்மாறிலி);
        }
        return this;
    }

    public எழுத்துவகை குறிவிலக்கி(int தமிழ்தனிகுறியீடு) {
        StringBuilder  ஒருங்குறிவார்தை = new StringBuilder();
        // final static int உயிர்எண்மாறிலி = 512;
        // final static int ஒற்றுஎண்மாறிலி = 1024;

        // uyir or uyirmai or orra

        if (தமிழ்தனிகுறியீடுஆயுதமா(தமிழ்தனிகுறியீடு)) {
            ஒருங்குறிவார்தை.append("ஃ");

        } else if (தமிழ்தனிகுறியீடுஉயிர்மெய்யா(தமிழ்தனிகுறியீடு)) {
            ஒருங்குறிவார்தை.append(ஓற்றுஎழுத்தைப்பெறு(தமிழ்தனிகுறியீடு));
            ஒருங்குறிவார்தை.append(உயிரெழுத்தைப்பெறு(தமிழ்தனிகுறியீடு, true));

        } else if (தமிழ்தனிகுறியீடுமெய்யா(தமிழ்தனிகுறியீடு)) {
            ஒருங்குறிவார்தை.append(ஓற்றுஎழுத்தைப்பெறு(தமிழ்தனிகுறியீடு));
            ஒருங்குறிவார்தை.append("்");

        } else if (தமிழ்தனிகுறியீடுஉயிரா(தமிழ்தனிகுறியீடு)) {
            ஒருங்குறிவார்தை.append(உயிரெழுத்தைப்பெறு(தமிழ்தனிகுறியீடு, false));
        } else {
            ஒருங்குறிவார்தை.append(String.format("\\u%04x", (int) தமிழ்தனிகுறியீடு));
        }
        return new எழுத்துவகை(ஒருங்குறிவார்தை.toString(), தமிழ்தனிகுறியீடு);
    }

    private boolean தமிழ்தனிகுறியீடுமெய்யா(int தமிழ்தனிகுறியீடு) {
        return (தமிழ்தனிகுறியீடு & ஒற்றுஎண்மாறிலி)  == ஒற்றுஎண்மாறிலி;

    }

    private String உயிரெழுத்தைப்பெறு(int தமிழ்தனிகுறியீடு, boolean குறியீடா) {
        int உயிரெழுத்துஇடம் = 0x0007 & தமிழ்தனிகுறியீடு;
        if ((தமிழ்தனிகுறியீடு & நெடிலெண்மாறிலி) ==  நெடிலெண்மாறிலி) {
            if (குறியீடா) {
                return உயிரெழுத்துநெடில்குறியீடுகள்.get(உயிரெழுத்துஇடம்);
            }
          return   உயிரெழுத்துநெடில்கள்.get(உயிரெழுத்துஇடம்);
        } else {
            if (குறியீடா) {
                return உயிரெழுத்துகுறில்குறியீடுகள்.get(உயிரெழுத்துஇடம்);
            }
            return உயிரெழுத்துகுறில்கள்.get(உயிரெழுத்துஇடம்);
        }

    }

    private String ஓற்றுஎழுத்தைப்பெறு(int தமிழ்தனிகுறியீடு) {
        List<String> மெய்யெழுத்துக்கள் = new ArrayList<>();
        if (இடையினமா(தமிழ்தனிகுறியீடு)) {
            மெய்யெழுத்துக்கள் = இடையினமெய்யெழுத்துக்கள்();

        } else if (மெல்லினமா(தமிழ்தனிகுறியீடு)) {
            மெய்யெழுத்துக்கள் = மெல்லினமெய்யெழுத்துக்கள்();
        } else if (வல்லினமா(தமிழ்தனிகுறியீடு)) {

            மெய்யெழுத்துக்கள் = வல்லினமெய்யெழுத்துக்கள்();
        }

        int மெய்யெழுத்துக்களிடம் = (தமிழ்தனிகுறியீடு & 0x0070) >> 4;
        return மெய்யெழுத்துக்கள்.get(மெய்யெழுத்துக்களிடம்);

    }

    private boolean வல்லினமா(int தமிழ்தனிகுறியீடு) {
        return  இடையினமா(தமிழ்தனிகுறியீடு)? false : (தமிழ்தனிகுறியீடு & வல்லினஎண்மாறிலி) == வல்லினஎண்மாறிலி;
    }

    private boolean மெல்லினமா(int தமிழ்தனிகுறியீடு) {
        return  இடையினமா(தமிழ்தனிகுறியீடு)? false : (தமிழ்தனிகுறியீடு & மெல்லினஎண்மாறிலி) == மெல்லினஎண்மாறிலி;
    }

    private boolean இடையினமா(int தமிழ்தனிகுறியீடு) {
        return  (தமிழ்தனிகுறியீடு&இடையினஎண்மாறிலி) == இடையினஎண்மாறிலி;

    }

    private boolean தமிழ்தனிகுறியீடுஉயிரா(int தமிழ்தனிகுறியீடு) {
        return (தமிழ்தனிகுறியீடு & உயிர்எண்மாறிலி)  == உயிர்எண்மாறிலி;
    }

    private boolean தமிழ்தனிகுறியீடுஉயிர்மெய்யா(int தமிழ்தனிகுறியீடு) {
        return (தமிழ்தனிகுறியீடு & (உயிர்எண்மாறிலி|ஒற்றுஎண்மாறிலி))  == (உயிர்எண்மாறிலி|ஒற்றுஎண்மாறிலி);
    }

    private boolean தமிழ்தனிகுறியீடுஆயுதமா(int தமிழ்தனிகுறியீடு) {
        return (தமிழ்தனிகுறியீடு&ஆயுதஎண்மாறிலி) == ஆயுதஎண்மாறிலி;
    }


    int தலைகீழ்படிஇரண்டு(int inp) {
        int s=0x8000;
        // உள்ளீடு : 0000 0000 0000 0100
        // வெளியிடு : 1111 1111 1111 1011
        int தலைகீழ்படிஇரண்டு = 0;
        for (int i = 0; i < 8*2; i++) {
            if ((s & inp) == 0) {
                தலைகீழ்படிஇரண்டு = தலைகீழ்படிஇரண்டு | s;
            }

            s=s>>1;
        }
        return தலைகீழ்படிஇரண்டு;
    }


    public String ஒருங்குறியைபெறு() {
        return ஒருங்குறி;
    }

    private String unicode() {
        StringBuffer sb = new StringBuffer();
        for(int i=0; i < ஒருங்குறி.length(); i++) {
            char uniChar= ஒருங்குறி.charAt(i);
            sb.append(String.format("\\u%04x", (int) uniChar));
        }
        return sb.toString();
    }


    @Override
    public String toString() {
        return "\n" + ஒருங்குறி +  "=" +  unicode() +"|தமிழ்தனிகுறியீடு="  + String.format("%d", தமிழ்தனிகுறியீடு) +  "|படி16எண்=" + String.format("%04x", தமிழ்தனிகுறியீடு) +  "|படி2எண்=" + Binary.print(தமிழ்தனிகுறியீடு) + "|மெய்வகை=" + மெய்வகையைபெறு() + "|உயிர்வகை=" + உயிர்வகையைபெறு() + "|யாபியலெழுத்துவகை="+  யாபியலெழுத்துவகையைபெறு();
    }


}
