package இயேரி.தமிழிசை;

import java.util.List;

public class கீர்த்தனை  {
    String வகை;
    String இயற்றியவர்;
    String இராகம்;
    String தாளம்;
     பண் பண்;
    String மேளக்கர்த்தாஎண்;
    List<பாடல்> கீர்த்தனை;
    String பெயர்;

    பாணி பாணி;

    @Override
    public String toString() {
        return "கீர்த்தனை{" +
                "வகை='" + வகை + '\'' +
                ", இயற்றியவர்='" + இயற்றியவர் + '\'' +
                ", இராகம்='" + இராகம் + '\'' +
                ", தாளம்='" + தாளம் + '\'' +
                ", பண்='" + பண் + '\'' +
                ", பாணி='" + பாணி + '\'' +
                ", மேளக்கர்த்தாஎண்='" + மேளக்கர்த்தாஎண் + '\'' +
                ", கீர்த்தனை=" + கீர்த்தனை +
                ", பெயர்='" + பெயர் + '\'' +
                '}';
    }
}
