package இயேரி.தமிழிசை;

import java.util.List;

public class கீர்த்தனை  {
    String பெயர்;
    String இயற்றியவர்;
    String இராகம்;
    String தாளம்;
    String வகை;
    String பண்பெயர்;
    String பாணிபெயர்;
    String மேளக்கர்த்தாஎண்;
    பண் பண்;
    பாணி பாணி;
    String இசையின்வேகம்;
    List<பாடல்> கீர்த்தனை;


    @Override
    public String toString() {
        return "கீர்த்தனை{" +
                "வகை='" + வகை + '\'' +
                ", இயற்றியவர்='" + இயற்றியவர் + '\'' +
                ", இராகம்='" + இராகம் + '\'' +
                ", தாளம்='" + தாளம் + '\'' +
                ", பண்=" + பண் +
                ", பண்பெயர்='" + பண்பெயர் + '\'' +
                ", பாணிபெயர்='" + பாணிபெயர் + '\'' +
                ", மேளக்கர்த்தாஎண்='" + மேளக்கர்த்தாஎண் + '\'' +
                ", கீர்த்தனை=" + கீர்த்தனை +
                ", பெயர்='" + பெயர் + '\'' +
                ", பாணி=" + பாணி +
                ", இசையின்வேகம்='" + இசையின்வேகம் + '\'' +
                '}';
    }
}
