package இயேரி.தமிழிசை;

import java.util.*;

public class சுரங்கள் {

    int மதிப்பு;

    public int மதிப்பு() {
        return மதிப்பு;
    }



    public static enum குரல்  {
            ச(0,0);

        சுரங்கள்V2.சுரம் சுரம்;
        int மதிப்பு;
        int சுரத்தானம் ;

        குரல்(int மதிப்பு, int  சுரத்தானம்) {
            this.மதிப்பு = மதிப்பு;
            this.சுரத்தானம் = சுரத்தானம்;
            this.சுரம் = சுரங்கள்V2.சுரம்.ச;
        }

        public int மதிப்பு() {
            return மதிப்பு;
        }

        public void setமதிப்பு(int மதிப்பு) {
            this.மதிப்பு = மதிப்பு;
        }

        public int getசுரத்தானம்() {
            return சுரத்தானம்;
        }

        public void setசுரத்தானம்(int சுரத்தானம்) {
            this.சுரத்தானம் = சுரத்தானம்;
        }

        public சுரங்கள்V2.சுரம் getசுரம்() {
            return சுரம்;
        }

        public void setசுரம்(சுரங்கள்V2.சுரம் சுரம்) {
            this.சுரம் = சுரம்;
        }
    }

    public static enum துத்தம் {
        ரி1(0, 1),
        ரி2(12, 2),
        ரி3(18, 3);

        சுரங்கள்V2.சுரம் சுரம்;
        int மதிப்பு;
        int சுரத்தானம் ;
        துத்தம்(int மதிப்பு, int சுரத்தானம் ) {
            this.மதிப்பு = மதிப்பு;
            this.சுரத்தானம் = சுரத்தானம் ;
            if (சுரங்கள்V2.சுரம்.ரி1.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.ரி1.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.ரி1;
            }
            if (சுரங்கள்V2.சுரம்.ரி2.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.ரி2.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.ரி2;
            }
            if (சுரங்கள்V2.சுரம்.ரி3.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.ரி3.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.ரி3;
            }
        }

        public int getசுரத்தானம்() {
            return சுரத்தானம்;
        }

        public void setசுரத்தானம்(int சுரத்தானம்) {
            this.சுரத்தானம் = சுரத்தானம்;
        }

        public சுரங்கள்V2.சுரம் getசுரம்() {
            return சுரம்;
        }

        public void setசுரம்(சுரங்கள்V2.சுரம் சுரம்) {
            this.சுரம் = சுரம்;
        }
    }

    public static  enum கைக்கிளை {
        க1(0,2),
        க2(6,3),
        க3(12,4);
        int மதிப்பு;
        int சுரத்தானம் ;
        சுரங்கள்V2.சுரம் சுரம்;
        கைக்கிளை(int மதிப்பு, int சுரத்தானம் ) {
            this.மதிப்பு = மதிப்பு;
            this.சுரத்தானம் = சுரத்தானம் ;
            if (சுரங்கள்V2.சுரம்.க1.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.க1.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.க1;
            }

            if (சுரங்கள்V2.சுரம்.க2.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.க2.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.க2;
            }

            if (சுரங்கள்V2.சுரம்.க3.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.க3.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.க3;
            }
        }

        public int மதிப்பு() {
            return மதிப்பு;
        }

        public void setமதிப்பு(int மதிப்பு) {
            this.மதிப்பு = மதிப்பு;
        }

        public int getசுரத்தானம்() {
            return சுரத்தானம்;
        }

        public void setசுரத்தானம்(int சுரத்தானம்) {
            this.சுரத்தானம் = சுரத்தானம்;
        }

        public சுரங்கள்V2.சுரம் getசுரம்() {
            return சுரம்;
        }

        public void setசுரம்(சுரங்கள்V2.சுரம் சுரம்) {
            this.சுரம் = சுரம்;
        }
    }

    public static enum உழை {
        ம1(0, 5),
        ம2(36, 6);
        int மதிப்பு;
        int சுரத்தானம் ;
        சுரங்கள்V2.சுரம் சுரம்;

        உழை(int மதிப்பு, int சுரத்தானம் ) {
            this.மதிப்பு = மதிப்பு;
            this.சுரத்தானம் = சுரத்தானம்;
            if (சுரங்கள்V2.சுரம்.ம1.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.ம1.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.ம1;
            }
            if (சுரங்கள்V2.சுரம்.ம2.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.ம2.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.ம2;
            }
        }

        public int மதிப்பு() {
            return மதிப்பு;
        }

        public void setமதிப்பு(int மதிப்பு) {
            this.மதிப்பு = மதிப்பு;
        }

        public int getசுரத்தானம்() {
            return சுரத்தானம்;
        }

        public void setசுரத்தானம்(int சுரத்தானம்) {
            this.சுரத்தானம் = சுரத்தானம்;
        }

        public சுரங்கள்V2.சுரம் getசுரம்() {
            return சுரம்;
        }

        public void setசுரம்(சுரங்கள்V2.சுரம் சுரம்) {
            this.சுரம் = சுரம்;
        }
    }

    public static enum இளி {
        ப(0, 7);
        int மதிப்பு;
        int சுரத்தானம் ;
        சுரங்கள்V2.சுரம் சுரம்;
        இளி(int மதிப்பு,int சுரத்தானம் ) {
            this.மதிப்பு = மதிப்பு;
            this.சுரத்தானம் =  சுரத்தானம்;
            if (சுரங்கள்V2.சுரம்.ப.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.ப.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.ப;
            }
        }

        public int மதிப்பு() {
            return மதிப்பு;
        }

        public void setமதிப்பு(int மதிப்பு) {
            this.மதிப்பு = மதிப்பு;
        }

        public int getசுரத்தானம்() {
            return சுரத்தானம்;
        }

        public void setசுரத்தானம்(int சுரத்தானம்) {
            this.சுரத்தானம் = சுரத்தானம்;
        }

        public சுரங்கள்V2.சுரம் getசுரம்() {
            return சுரம்;
        }

        public void setசுரம்(சுரங்கள்V2.சுரம் சுரம்) {
            this.சுரம் = சுரம்;
        }
    }

    public static enum விளரி {

        த1(0,8),
        த2(2,9),
        த3(3,10);
        சுரங்கள்V2.சுரம் சுரம் ;
        int மதிப்பு;
        int சுரத்தானம் ;


        விளரி(int மதிப்பு, int சுரத்தானம் ) {
            this.மதிப்பு = மதிப்பு;
            this.சுரத்தானம் = சுரத்தானம்;
            if (சுரங்கள்V2.சுரம்.த1.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.த1.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.த1;
            }
            if (சுரங்கள்V2.சுரம்.த2.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.த2.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.த2;
            }
            if (சுரங்கள்V2.சுரம்.த3.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.த3.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.த3;
            }
        }

        public சுரங்கள்V2.சுரம் getசுரம்() {
            return சுரம்;
        }

        public void setசுரம்(சுரங்கள்V2.சுரம் சுரம்) {
            this.சுரம் = சுரம்;
        }

        public int getமதிப்பு() {
            return மதிப்பு;
        }

        public void setமதிப்பு(int மதிப்பு) {
            this.மதிப்பு = மதிப்பு;
        }

        public int getசுரத்தானம்() {
            return சுரத்தானம்;
        }

        public void setசுரத்தானம்(int சுரத்தானம்) {
            this.சுரத்தானம் = சுரத்தானம்;
        }
    }

    public static enum தாரம் {

        நி1(1, 9),
        நி2(2,10),
        நி3(3,11);

        சுரங்கள்V2.சுரம் சுரம்;
        int மதிப்பு;
        int சுரத்தானம் ;

        தாரம்(int மதிப்பு, int சுரத்தானம் ) {
            this.மதிப்பு = மதிப்பு;
            this.சுரத்தானம் = சுரத்தானம் ;
            if (சுரங்கள்V2.சுரம்.நி1.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.நி1.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.நி1;
            }
            if (சுரங்கள்V2.சுரம்.நி2.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.நி2.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.நி2;
            }
            if (சுரங்கள்V2.சுரம்.நி3.மதிப்பு == மதிப்பு && சுரங்கள்V2.சுரம்.நி3.சுரத்தானம் == சுரத்தானம் ) {
                this.சுரம் = சுரங்கள்V2.சுரம்.நி3;
            }
        }

        public int மதிப்பு() {
            return மதிப்பு;
        }

        public void setமதிப்பு(int மதிப்பு) {
            this.மதிப்பு = மதிப்பு;
        }

        public int getசுரத்தானம்() {
            return சுரத்தானம்;
        }

        public void setசுரத்தானம்(int சுரத்தானம்) {
            this.சுரத்தானம் = சுரத்தானம்;
        }

        public சுரங்கள்V2.சுரம் getசுரம்() {
            return சுரம்;
        }

        public void setசுரம்(சுரங்கள்V2.சுரம் சுரம்) {
            this.சுரம் = சுரம்;
        }
    }


    குரல் ச;
    துத்தம் ரி;
    கைக்கிளை க;
    உழை ம;
    இளி ப;
    விளரி த;
    தாரம் நி;


    public void setமதிப்பு(int மதிப்பு) {
        this.மதிப்பு = மதிப்பு;
    }



    public குரல் ச() {
        return ச;
    }

    public void சவைப்பிடி(குரல் ச) {
        this.ச = ச;
    }

    public துத்தம் ரி() {
        return ரி;
    }

    public void ரியைப்பிடி(துத்தம் ரி) {
        this.ரி = ரி;
    }

    public கைக்கிளை க() {
        return க;
    }

    public void கவைப்பிடி(கைக்கிளை க) {
        if (this.ரி == துத்தம்.ரி3 && க != கைக்கிளை.க3
                ||  this.ரி == துத்தம்.ரி2  &&  க != கைக்கிளை.க2 &&  க != கைக்கிளை.க3 ) {
            throw new RuntimeException(this.ரி  + " மற்றும் " + க  +" பகை சுரஙள் " );
        }
        this.க = க;
    }

    public உழை ம() {
        return ம;
    }

    public void மவைப்பிடி(உழை ம) {
        this.ம = ம;
    }

    public இளி ப() {
        return ப;
    }

    public void பவைப்பிடி(இளி ப) {
        this.ப = ப;
    }

    public விளரி த() {
        return த;
    }

    public void தவைப்பிடி(விளரி த) {
        this.த = த;
    }

    public தாரம் நி() {
        return நி;
    }

    public void நியைப்பிடி(தாரம் நி) {
        if (this.த ==  விளரி.த3 &&  நி != தாரம்.நி3  ||  this.த ==  விளரி.த2 && நி != தாரம்.நி2  && நி != தாரம்.நி3  ) {
            throw new RuntimeException(this.த  + " மற்றும் " + நி  +" பகை சுரஙள் " );
        }
        this.நி = நி;
    }


    public int மேளகர்தா() {
        return  ச.மதிப்பு +  ரி.மதிப்பு + க.மதிப்பு + ம.மதிப்பு + ப.மதிப்பு + த.மதிப்பு + நி.மதிப்பு;
    }


    List<சுரங்கள்V2.சுரம்> சுரத்தைபெறு() {
        List<சுரங்கள்V2.சுரம்> சுரப்பதட்டியல்=new ArrayList<>();
        if (Objects.nonNull(ச)) {
            சுரப்பதட்டியல்.add(ச.சுரம்);
        }

        if (Objects.nonNull(ரி)) {
            சுரப்பதட்டியல்.add(ரி.சுரம்);
        }

        if (Objects.nonNull(க)) {
            சுரப்பதட்டியல்.add(க.சுரம்);
        }
        if (Objects.nonNull(ம)) {
            சுரப்பதட்டியல்.add(ம.சுரம்);
        }

        if (Objects.nonNull(ப)) {
            சுரப்பதட்டியல்.add(ப.சுரம்);
        }

        if (Objects.nonNull(த)) {
            சுரப்பதட்டியல்.add(த.சுரம்);
        }

        if (Objects.nonNull(நி)) {
            சுரப்பதட்டியல்.add(நி.சுரம்);
        }
        return சுரப்பதட்டியல்;
    }

    Map<String,சுரங்கள்V2.சுரம்> விசைமதிப்புவரைபடசுரத்தைபெறு() {
        Map<String, சுரங்கள்V2.சுரம்> சுரப்பதட்டியல்=new HashMap<>();
        if (Objects.nonNull(ச)) {
            சுரப்பதட்டியல்.put("ச", ச.சுரம்);
        }

        if (Objects.nonNull(ரி)) {
            சுரப்பதட்டியல்.put("ரி",ரி.சுரம்);
        }

        if (Objects.nonNull(க)) {
            சுரப்பதட்டியல்.put("க",க.சுரம்);
        }
        if (Objects.nonNull(ம)) {
            சுரப்பதட்டியல்.put("ம",ம.சுரம்);
        }

        if (Objects.nonNull(ப)) {
            சுரப்பதட்டியல்.put("ப",ப.சுரம்);
        }

        if (Objects.nonNull(த)) {
            சுரப்பதட்டியல்.put("த",த.சுரம்);
        }

        if (Objects.nonNull(நி)) {
            சுரப்பதட்டியல்.put("நி",நி.சுரம்);
        }
        return சுரப்பதட்டியல்;
    }

     சுரங்கள்V2.சுரம் சுரங்களைபெறு(String சுரம்) {
         return விசைமதிப்புவரைபடசுரத்தைபெறு().get(சுரம்);
    }

    @Override
    public String toString() {
        return "சுரங்கள்{" +
                "ச=" + ச +
                ", ரி=" + ரி +
                ", க=" + க +
                ", ம=" + ம+
                ", ப=" + ப+
                ", த=" + த+
                ", நி="+  நி+
                "}, சுரப்பட்டியல்="+ சுரத்தைபெறு();
    }
}
