package இயேரி.தமிழிசை;

import java.util.List;

public class சுரவரிசை {
        String வகை;
        String இயற்றியவர்;
        String இராகம்;
        String தாளம்;
        String பண்;
        String பாணி;
        String மேளக்கர்த்தாஎண்;
        List<வரிசை> வரிகள்;
        String பெயர்;


        public static class வரிசை extends வரி {
                int எண்;

                public int getஎண்() {
                        return எண்;
                }

                public void setஎண்(int எண்) {
                        this.எண் = எண்;
                }

                @Override
                public String toString() {
                        return "வரிசை{" +
                                "எண்=" + எண் +
                                ", சுரம்='" + சுரம் + '\'' +
                                ", சுரவளவு='" + சுரவளவு + '\'' +
                                ", சுரகாலளவு='" + சுரகாலளவு + '\'' +
                                ", வார்த்தை='" + வார்த்தை + '\'' +
                                ", அக்சரகாலம்='" + அக்சரகாலம் + '\'' +
                                ", அக்சரகாலதசமஎண்=" + அக்சரகாலதசமஎண் +
                                ", காலம்=" + காலம் +
                                ", பாடும்காலம்=" + பாடும்காலம் +
                                ", சுரங்கள்=" + சுரங்கள் +
                                ", எளிமைசுரம்='" + எளிமைசுரம் + '\'' +
                                ", எளிமைகாலம்=" + எளிமைகாலம் +
                                '}';
                }
        }

        @Override
        public String toString() {
                return "சுரவரிசை{" +
                        "வகை='" + வகை + '\'' +
                        ", இயற்றியவர்='" + இயற்றியவர் + '\'' +
                        ", இராகம்='" + இராகம் + '\'' +
                        ", தாளம்='" + தாளம் + '\'' +
                        ", பண்='" + பண் + '\'' +
                        ", பாணி='" + பாணி + '\'' +
                        ", மேளக்கர்த்தாஎண்='" + மேளக்கர்த்தாஎண் + '\'' +
                        ", வரிகள்=" + வரிகள் +
                        ", பெயர்='" + பெயர் + '\'' +
                        '}';
        }
}
