package இயேரி.தமிழிசை;

import java.util.List;

public class சுரவரிசை extends  கீர்த்தனை{

        பண் பண்;
        பாணி பாணி;
        public இயேரி.தமிழிசை.பண் getபண்() {
                return பண்;
        }

        public void setபண்(இயேரி.தமிழிசை.பண் பண்) {
                this.பண் = பண்;
        }

        List<வரி> வரிகள்;

        public List<வரி> getவரிகள்() {
                return வரிகள்;
        }

        public void setவரிகள்(List<வரி> வரிகள்) {
                this.வரிகள் = வரிகள்;
        }

        @Override
        public String toString() {
                return "சுரவரிசை{" +
                        "வரிகள்=" + வரிகள் +
                        ", வகை='" + வகை + '\'' +
                        ", இயற்றியவர்='" + இயற்றியவர் + '\'' +
                        ", இராகம்='" + இராகம் + '\'' +
                        ", தாளம்='" + தாளம் + '\'' +
                        ", பண்='" + பண் + '\'' +
                        ", பாணி='" + பாணி + '\'' +
                        ", மேளக்கர்த்தாஎண்='" + மேளக்கர்த்தாஎண் + '\'' +
                        ", கீர்த்தனை=" + கீர்த்தனை +
                        ", பெயர்='" + பெயர் + '\'' +
                        '}';
        }
}
