package இயேரி.தமிழிசை;
import java.util.ArrayList;
import java.util.List;

public class சீர் {



    static List<அடிவகை> அடிவகைபாகுபடுத்தி(List<எழுத்துவகை> சொற்கள்) {

        String a= new String();
        List<அடிவகை>  அடிகள் = new ArrayList<>();
        List <List<எழுத்துவகை>> அடிசொற்கள் = அடிசொற்கள்பாகுபடுத்தி(சொற்கள்);
        int சீர் = 1;
        for(int படி=0;  படி < அடிசொற்கள்.size()  ; படி++) {
            List<List<எழுத்துவகை>> சொற்கள்மாறி = சொற்கள்பாகுபடுத்தி(அடிசொற்கள்.get(படி));
            for(List<எழுத்துவகை>  சொல் : சொற்கள்மாறி) {
                if (!சொல்.isEmpty()) {
                    அடிகள்.add(new அடிவகை(பாகுபடுத்தி(சொல், சீர்), படி + 1));
                    சீர்++;
                }
              }
        }
      return  அடிகள்;
    }

    private static List<List<எழுத்துவகை>> அடிசொற்கள்பாகுபடுத்தி(List<எழுத்துவகை> சொற்கள்) {
        List <List<எழுத்துவகை>> அடிசொற்கள் = new ArrayList<>();
        List<எழுத்துவகை> அடி = new ArrayList<>();
        for (எழுத்துவகை சொல் : சொற்கள்) {
            if (சொல் instanceof  குறியீடு) {

                if ("\n".equals(சொல்.ஒருங்குறி)) {
                    அடிசொற்கள்.add(அடி);
                    அடி = new ArrayList<>();
                } else {
                    அடி.add(சொல்);
                }
            } else {
                அடி.add(சொல்);

            }

        }

        if (!அடி.isEmpty()) {
            அடிசொற்கள்.add(அடி);
        }
        return  அடிசொற்கள்;
    }

    private static List<List<எழுத்துவகை>> சொற்கள்பாகுபடுத்தி(List<எழுத்துவகை> சொற்கள்) {
        List <List<எழுத்துவகை>> அடிசொற்கள் = new ArrayList<>();
        List<எழுத்துவகை> அடி = new ArrayList<>();
        for (எழுத்துவகை எழுத்துமாறி : சொற்கள்) {
            if (எழுத்துமாறி instanceof  குறியீடு) {

                if (" ".equals(எழுத்துமாறி.ஒருங்குறி) || "\t".equals(எழுத்துமாறி.ஒருங்குறி) ) {
                    அடிசொற்கள்.add(அடி);
                    அடி = new ArrayList<>();
                } else {
                    அடி.add(எழுத்துமாறி);
                }
            } else {
                அடி.add(எழுத்துமாறி);

            }

        }

        if (!அடி.isEmpty()) {
            அடிசொற்கள்.add(அடி);
        }
        return  அடிசொற்கள்;
    }



    static List<அசைவகை> பாகுபடுத்தி(List<எழுத்துவகை> சொல், int சீர்) {
        எழுத்துவகை  முன்முன்றுனெழுறுத்து = new எழுத்துவகை("", 0);
        எழுத்துவகை  முன்இருமுனெழுத்து = new எழுத்துவகை("", 0);
        எழுத்துவகை முன்முனெழுத்து = new எழுத்துவகை("", 0);
        எழுத்துவகை எழுத்து;
        int தவிர்=0;
        List<அசைவகை>  அசைகள்= new ArrayList<>();
        for (int i =0; i < சொல்.size() + 2; i++) {
            if ( i < சொல்.size()) {
                எழுத்து = சொல்.get(i);
            } else {
                எழுத்து = new குறியீடு(" ", 0);
            }

            if (தவிர் == 0) {

                if (முன்முன்றுனெழுறுத்து instanceof  குறியீடு) {
                    தவிர்=0;
                }  else if (முன்முன்றுனெழுறுத்து.குறிலா() && முன்இருமுனெழுத்து.நெடிலா() && முன்முனெழுத்து.ஒற்றா() && எழுத்து.ஒற்றா()) {
                    List<எழுத்துவகை> அசைஎழுத்துக்கள் = new ArrayList<>();
                    அசைஎழுத்துக்கள்.add(முன்முன்றுனெழுறுத்து);
                    அசைஎழுத்துக்கள்.add(முன்இருமுனெழுத்து);
                    அசைஎழுத்துக்கள்.add(முன்முனெழுத்து);
                    அசைஎழுத்துக்கள்.add(எழுத்து);
                    தவிர்=3;
                    அசைவகை நிரையசை = new அசைவகை(அசைஎழுத்துக்கள், அசைவகை.நிரைமாறிலி, சீர்);
                    அசைகள்.add(நிரையசை);
                } else if (முன்முன்றுனெழுறுத்து.குறிலா() && முன்இருமுனெழுத்து.குறிலா() && முன்முனெழுத்து.ஒற்றா() && எழுத்து.ஒற்றா()) {
                    List<எழுத்துவகை> அசைஎழுத்துக்கள் = new ArrayList<>();
                    அசைஎழுத்துக்கள்.add(முன்முன்றுனெழுறுத்து);
                    அசைஎழுத்துக்கள்.add(முன்இருமுனெழுத்து);
                    அசைஎழுத்துக்கள்.add(முன்முனெழுத்து);
                    அசைஎழுத்துக்கள்.add(எழுத்து);
                    தவிர்=3;
                    அசைவகை நிரையசை = new அசைவகை(அசைஎழுத்துக்கள், அசைவகை.நிரைமாறிலி, சீர்);
                    அசைகள்.add(நிரையசை);
                } else if (முன்முன்றுனெழுறுத்து.குறிலா() && முன்இருமுனெழுத்து.நெடிலா() && முன்முனெழுத்து.ஒற்றா()) {
                    List<எழுத்துவகை> அசைஎழுத்துக்கள் = new ArrayList<>();
                    அசைஎழுத்துக்கள்.add(முன்முன்றுனெழுறுத்து);
                    அசைஎழுத்துக்கள்.add(முன்இருமுனெழுத்து);
                    அசைஎழுத்துக்கள்.add(முன்முனெழுத்து);
                    தவிர்=2;
                    அசைவகை நிரையசை = new அசைவகை(அசைஎழுத்துக்கள், அசைவகை.நிரைமாறிலி, சீர்);
                    அசைகள்.add(நிரையசை);
                } else if (முன்முன்றுனெழுறுத்து.குறிலா() && முன்இருமுனெழுத்து.குறிலா() && முன்முனெழுத்து.ஒற்றா()) {
                    List<எழுத்துவகை> அசைஎழுத்துக்கள் = new ArrayList<>();
                    அசைஎழுத்துக்கள்.add(முன்முன்றுனெழுறுத்து);
                    அசைஎழுத்துக்கள்.add(முன்இருமுனெழுத்து);
                    அசைஎழுத்துக்கள்.add(முன்முனெழுத்து);
                    தவிர்=2;
                    அசைவகை நிரையசை = new அசைவகை(அசைஎழுத்துக்கள், அசைவகை.நிரைமாறிலி, சீர்);
                    அசைகள்.add(நிரையசை);
                } else if (முன்முன்றுனெழுறுத்து.குறிலா() && முன்இருமுனெழுத்து.குறிலா()) {
                    List<எழுத்துவகை> அசைஎழுத்துக்கள் = new ArrayList<>();
                    அசைஎழுத்துக்கள்.add(முன்முன்றுனெழுறுத்து);
                    அசைஎழுத்துக்கள்.add(முன்இருமுனெழுத்து);
                    தவிர்=1;
                    அசைவகை நிரையசை = new அசைவகை(அசைஎழுத்துக்கள், அசைவகை.நிரைமாறிலி,சீர்);
                    அசைகள்.add(நிரையசை);
                } else if (முன்முன்றுனெழுறுத்து.குறிலா() && முன்இருமுனெழுத்து.நெடிலா()) {
                    List<எழுத்துவகை> அசைஎழுத்துக்கள் = new ArrayList<>();
                    அசைஎழுத்துக்கள்.add(முன்முன்றுனெழுறுத்து);
                    அசைஎழுத்துக்கள்.add(முன்இருமுனெழுத்து);
                    தவிர்=1;
                    அசைவகை நிரையசை = new அசைவகை(அசைஎழுத்துக்கள், அசைவகை.நிரைமாறிலி,சீர்);
                    அசைகள்.add(நிரையசை);

                } else if (முன்முன்றுனெழுறுத்து.குறிலா() && முன்இருமுனெழுத்து.நெடிலா()) {
                    List<எழுத்துவகை> அசைஎழுத்துக்கள் = new ArrayList<>();
                    அசைஎழுத்துக்கள்.add(முன்முன்றுனெழுறுத்து);
                    அசைஎழுத்துக்கள்.add(முன்இருமுனெழுத்து);
                    தவிர்=1;
                    அசைவகை நிரையசை = new அசைவகை(அசைஎழுத்துக்கள், அசைவகை.நிரைமாறிலி,சீர்);
                    அசைகள்.add(நிரையசை);
                } else if (முன்முன்றுனெழுறுத்து.குறிலா() && முன்இருமுனெழுத்து.ஒற்றா() && !முன்முனெழுத்து.ஒற்றா()) {
                    List<எழுத்துவகை> அசைஎழுத்துக்கள் = new ArrayList<>();
                    அசைஎழுத்துக்கள்.add(முன்முன்றுனெழுறுத்து);
                    அசைஎழுத்துக்கள்.add(முன்இருமுனெழுத்து);
                    தவிர்=1;
                    அசைவகை நேரசை = new அசைவகை(அசைஎழுத்துக்கள், அசைவகை.நேரசைமாறிலி,சீர்);
                    அசைகள்.add(நேரசை);
                } else if (முன்முன்றுனெழுறுத்து.நெடிலா() && முன்இருமுனெழுத்து.ஒற்றா()) {
                    List<எழுத்துவகை> அசைஎழுத்துக்கள் = new ArrayList<>();
                    அசைஎழுத்துக்கள்.add(முன்முன்றுனெழுறுத்து);
                    அசைஎழுத்துக்கள்.add(முன்இருமுனெழுத்து);
                    தவிர்=1;
                    அசைவகை நேரசை = new அசைவகை(அசைஎழுத்துக்கள், அசைவகை.நேரசைமாறிலி,சீர்);
                    அசைகள்.add(நேரசை);
                } else if (முன்முன்றுனெழுறுத்து.நெடிலா()) {
                    List<எழுத்துவகை> அசைஎழுத்துக்கள் = new ArrayList<>();
                    அசைஎழுத்துக்கள்.add(முன்முன்றுனெழுறுத்து);
                    தவிர்=0;
                    அசைவகை நேரசை = new அசைவகை(அசைஎழுத்துக்கள், அசைவகை.நேரசைமாறிலி,சீர்);
                    அசைகள்.add(நேரசை);
                } else if (முன்முன்றுனெழுறுத்து.குறிலா()) {
                    List<எழுத்துவகை> அசைஎழுத்துக்கள் = new ArrayList<>();
                    அசைஎழுத்துக்கள்.add(முன்முன்றுனெழுறுத்து);
                    தவிர்=0;
                    அசைவகை நேரசை = new அசைவகை(அசைஎழுத்துக்கள், அசைவகை.நேரசைமாறிலி,சீர்);
                    அசைகள்.add(நேரசை);
                } else if (முன்முன்றுனெழுறுத்து.நெடிலா() && முன்இருமுனெழுத்து instanceof  குறியீடு) {
                    List<எழுத்துவகை> அசைஎழுத்துக்கள் = new ArrayList<>();
                    அசைஎழுத்துக்கள்.add(முன்முன்றுனெழுறுத்து);
                    தவிர்=0;
                    அசைவகை நேரசை = new அசைவகை(அசைஎழுத்துக்கள், அசைவகை.நேரசைமாறிலி,சீர்);
                    அசைகள்.add(நேரசை);
                } else if (முன்முன்றுனெழுறுத்து.குறிலா() && முன்இருமுனெழுத்து instanceof  குறியீடு) {
                    List<எழுத்துவகை> அசைஎழுத்துக்கள் = new ArrayList<>();
                    அசைஎழுத்துக்கள்.add(முன்முன்றுனெழுறுத்து);
                    தவிர்=0;
                    அசைவகை நேரசை = new அசைவகை(அசைஎழுத்துக்கள், அசைவகை.நேரசைமாறிலி,சீர்);
                    அசைகள்.add(நேரசை);
                }
            } else {
                தவிர்--;
            }


            முன்முன்றுனெழுறுத்து = முன்இருமுனெழுத்து;
            முன்இருமுனெழுத்து = முன்முனெழுத்து;
            முன்முனெழுத்து = எழுத்து;
        }

        return அசைகள்;
    }

}
