package இயேரி.தமிழிசை;

public class சுரங்கள்V2 {


    public static enum சுரம்  {
        ச(0,0, "ச"),
        ரி1(0,1, "ரி"),
        ரி2(12,2,"ரி" ),
        ரி3(18,3, "ரி"),
        க1(0,2, "க"),
        க2(6,3, "க"),
        க3(12,4, "க"),
        ம1(0, 5, "ம"),
        ம2(36,6, "ம"),
        ப(0,7, "ப"),
        த1(0,8, "த"),
        த2(2,9,"த"),
        த3(3,10,"த"),
        நி1(1,9, "நி"),
        நி2(2,10, "நி"),
        நி3(3,11, "நி");
        String சுரம் ;
        int மதிப்பு;
        int சுரத்தானம்;

        சுரம்(int மதிப்பு, int சுரத்தானம், String சுரம்) {
            this.சுரத்தானம் = சுரத்தானம்;
            this.மதிப்பு = மதிப்பு;
            this.சுரம் = சுரம்;
        }

        public int getமதிப்பு() {
            return மதிப்பு;
        }

        public void setமதிப்பு(int மதிப்பு) {
            this.மதிப்பு = மதிப்பு;
        }

        public int getசுரத்தானம்() {
            return சுரத்தானம்;
        }

        public void setசுரத்தானம்(int சுரத்தானம்) {
            this.சுரத்தானம் = சுரத்தானம்;
        }

        public String getசுரம்() {
            return சுரம்;
        }

        public void setசுரம்(String சுரம்) {
            this.சுரம் = சுரம்;
        }
    }
    }
