package இயேரி.தமிழிசை;

public class பண் {



    public சுரங்கள் இற்ங்குவரிசை() {
        return இறங்குவரிசை;
    }

    public void setஇறங்குவரிசை(சுரங்கள் இறங்குவரிசை) {
        this.இறங்குவரிசை = இறங்குவரிசை;
    }

    public சுரங்கள் ஏறுவரிசை() {
        return ஏறுவரிசை;
    }

    public void setஏறுவரிசை(சுரங்கள் ஏறுவரிசை) {
        this.ஏறுவரிசை = ஏறுவரிசை;
    }

    சுரங்கள் இறங்குவரிசை;
    சுரங்கள் ஏறுவரிசை;


    public int மேளகர்ததாஎண்() {
        return   (இறங்குவரிசை.மேளகர்தா() >  ஏறுவரிசை.மேளகர்தா() ? இறங்குவரிசை.மேளகர்தா() :  ஏறுவரிசை.மேளகர்தா());
    }

    @Override
    public String toString() {
        return "பண்{" +
                "இறங்குவரிசை=" + இறங்குவரிசை +
                ", ஏறுவரிசை=" + ஏறுவரிசை +
                ", இறங்குவரிசை.மேளகர்தா=" + இறங்குவரிசை.மேளகர்தா() +"" +
                ",  ஏறுவரிசை.மேளகர்தா=" + ஏறுவரிசை.மேளகர்தா() +"" +
                ", மேளகர்ததாஎண் =" + மேளகர்ததாஎண்() + "" +
                '}';
    }
}
