package இயேரி.தமிழிசை;

import java.util.ArrayList;
import java.util.List;

public abstract class பாணி {
    /*
    துருவம்
    மட்டியம்
    ரூபம்
    சம்பை
    திரிபுடை
    அட
    ஏகம்
     */
    enum  பிரிவு {
        I3(3),
        I4(4),
        I5(5),
        I7(7),
        I9(9),
        O(2),
        U(1);
        int மதிப்பு;
        பிரிவு(int மதிப்பு) {
            this.மதிப்பு = மதிப்பு;
        }
    }
    enum லகு {
        I3(3),
        I4(4),
        I5(5),
        I7(7),
        I9(9) ;

        பிரிவு பிரிவு;
        int மதிப்பு;
        லகு(int மதிப்பு) {
            this.மதிப்பு = மதிப்பு;

            if (பிரிவு.I3.மதிப்பு == மதிப்பு) {
                பிரிவு = பிரிவு.I3;
            } else if (பிரிவு.I4.மதிப்பு == மதிப்பு) {
                பிரிவு = பிரிவு.I4;
            } else if (பிரிவு.I5.மதிப்பு == மதிப்பு) {
                பிரிவு = பிரிவு.I5;
            } else if (பிரிவு.I7.மதிப்பு == மதிப்பு) {
                பிரிவு = பிரிவு.I7;
            } else if (பிரிவு.I9.மதிப்பு == மதிப்பு) {
                பிரிவு = பிரிவு.I9;
            }

            }
        }





    enum சுழி {
        O(2);
        int மதிப்பு;
        பாணி.பிரிவு பிரிவு;
        சுழி(int மதிப்பு) {
            this.மதிப்பு = மதிப்பு;
            if (பாணி.பிரிவு.O.மதிப்பு == மதிப்பு) {
                this.பிரிவு = பாணி.பிரிவு.O;
            }
        }
    }


    enum அரைசுழி {
        U(1);
         பாணி.பிரிவு பிரிவு;
        int மதிப்பு;
        அரைசுழி(int மதிப்பு) {
            this.மதிப்பு = மதிப்பு;
            if (பாணி.பிரிவு.U.மதிப்பு == மதிப்பு) {
                this.பிரிவு = பாணி.பிரிவு.U;
            }
        }
    }

    static லகு லகு;

    பாணி(லகு லகு) {
        this.லகு = லகு;
    }

    public abstract List<பிரிவு> பெறு();


    public static class துருவம் extends பாணி {
        லகு I1;
        சுழி O2;
        லகு I3;
        லகு I4;

        துருவம்(லகு லகு) {
            super(லகு);
            this.I1= லகு;
            this.O2= சுழி.O;
            this.I3= லகு;
            this.I4= லகு;
        }

        public List<பிரிவு> பெறு() {
            List<பிரிவு> துருவபாணி = new ArrayList<>();
            துருவபாணி.add(I1.பிரிவு);
            துருவபாணி.add(O2.பிரிவு);
            துருவபாணி.add(I3.பிரிவு);
            துருவபாணி.add(I4.பிரிவு);
            return துருவபாணி;
        }
    }
    public static class மட்டியம் extends பாணி {
        லகு I1;
        சுழி O2;
        லகு I3;

        மட்டியம்(லகு லகு) {
            super(லகு);
        }
        public List<பிரிவு> பெறு() {
            List<பிரிவு> மட்டியபாணி = new ArrayList<>();
            மட்டியபாணி.add(I1.பிரிவு);
            மட்டியபாணி.add(O2.பிரிவு);
            மட்டியபாணி.add(I3.பிரிவு);
            return மட்டியபாணி;
        }
    }

    public static class ரூபம் extends பாணி {
        சுழி O1;
        லகு I2;
        ரூபம்(லகு லகு) {
            super(லகு);
            this.O1 = சுழி.O;
            this.I2 = லகு;
        }
        public List<பிரிவு> பெறு() {
            List<பிரிவு> ரூபகபாணி = new ArrayList<>();
            ரூபகபாணி.add(O1.பிரிவு);
            ரூபகபாணி.add(I2.பிரிவு);
            return ரூபகபாணி;
        }
    }

    public static class சம்பை extends பாணி {
        லகு I1;
        சுழி U2;
        லகு I3;
        சம்பை(லகு லகு) {
            super(லகு);
            this.I1 = லகு;
            this.U2 = சுழி.O;
            this.I3 = லகு;
        }

        public List<பிரிவு> பெறு() {
            List<பிரிவு> சம்பைபாணி = new ArrayList<>();
            சம்பைபாணி.add(I1.பிரிவு);
            சம்பைபாணி.add(U2.பிரிவு);
            சம்பைபாணி.add(I3.பிரிவு);
            return சம்பைபாணி;
        }
    }

    public static class திரிபுடை extends பாணி {
        லகு I1;
        சுழி O2;
        சுழி O3;
        திரிபுடை(லகு லகு) {
            super(லகு);
            I1 = லகு;
            O2 = சுழி.O;
            O3 = சுழி.O;
        }

        public List<பிரிவு> பெறு() {
            List<பிரிவு> திரிபுடைபாணி = new ArrayList<>();
            திரிபுடைபாணி.add(I1.பிரிவு);
            திரிபுடைபாணி.add(O2.பிரிவு);
            திரிபுடைபாணி.add(O3.பிரிவு);
            return திரிபுடைபாணி;
        }
    }

    public static class அட extends பாணி {
        லகு I1;
        லகு I2;
        சுழி O3;
        சுழி O4;
        அட(லகு லகு) {
            super(லகு);
            I1 = லகு;
            I2 = லகு;
            O3 = சுழி.O;
            O4 = சுழி.O;
        }

        public List<பிரிவு> பெறு() {
            List<பிரிவு> அடபாணி = new ArrayList<>();
            அடபாணி.add(I1.பிரிவு);
            அடபாணி.add(I2.பிரிவு);
            அடபாணி.add(O3.பிரிவு);
            அடபாணி.add(O4.பிரிவு);
            return அடபாணி;
        }
    }

    public static class ஏகம் extends பாணி {
        லகு I1;
        ஏகம்(லகு லகு) {
            super(லகு);
            I1 = லகு;
        }

        public List<பிரிவு> பெறு() {
            List<பிரிவு> ஏகபாணி = new ArrayList<>();
            ஏகபாணி.add(I1.பிரிவு);
            return ஏகபாணி;
        }
    }
}
