package இயேரி.தமிழிசை;

import java.util.List;

public class வரி {
    String சுரம்;
    String சுரவளவு;
    String சுரகாலளவு;
    String வார்த்தை;
    String அக்சரகாலம்;
    double அக்சரகாலதசமஎண்;
    double காலம்;
    double பாடும்காலம்;
    List<எழுத்துவகை>  சுரங்கள்;

    @Override
    public String toString() {
        return "வரி{" +
                "சுரம்='" + சுரம் + '\'' +
                ", சுரவளவு='" + சுரவளவு + '\'' +
                ", சுரகாலளவு='" + சுரகாலளவு + '\'' +
                ", வார்த்தை='" + வார்த்தை + '\'' +
                ", அக்சரகாலம்='" + அக்சரகாலம் + '\'' +
                ", அக்சரகாலதசமஎண்=" + அக்சரகாலதசமஎண் +
                ", காலம்=" + காலம் +
                '}';
    }
}
